{
  "app": {
    "title": "Calculateur de Taille d'Échantillon Biomédical",
    "subtitle": "Outils statistiques professionnels pour la conception de recherche",
    "welcome": {
      "title": "👋 Bienvenue dans le Calculateur de Taille d'Échantillon Biomédical",
      "subtitle": "Choisissez le type d'analyse statistique dont vous avez besoin pour votre étude de recherche",
      "estimation": "Études d'Estimation",
      "estimationDesc": "Calculer les tailles d'échantillon pour estimer les paramètres de population avec une précision spécifique",
      "hypothesis": "Tests d'Hypothèse",
      "hypothesisDesc": "Calculer les tailles d'échantillon pour comparer les groupes et tester les hypothèses statistiques",
      "rates": "Analyse des Taux et de Survie",
      "ratesDesc": "Calculer les tailles d'échantillon pour les études de comparaison de taux et de temps jusqu'à l'événement",
      "help": "💡 Vous ne savez pas quel test utiliser ? Chaque calculateur inclut des explications détaillées et des exemples pour vous aider à choisir la bonne méthode pour votre recherche."
    },
    "navigation": {
      "estimation": "📊 Estimation",
      "hypothesis": "🔬 Tests d'Hypothèse",
      "rates": "⏱️ Taux et Survie",
      "backToWelcome": "← Retour à tous les Calculateurs",
      "showCalculators": "☰ Afficher les Calculateurs",
      "closeMenu": "✕ Fermer le Menu",
      "settings": "⚙️ Paramètres"
    },
    "calculators": {
      "usage": "💡 Quand utiliser ce test",
      "example": "Exemple :",
      "requiredSampleSize": "Taille d'Échantillon Requise",
      "calculatedSampleSizes": "Tailles d'Échantillon Calculées",
      "requiredSampleSizePerGroup": "Taille d'Échantillon Requise par Groupe",
      "requiredNumberOfEvents": "Nombre d'Événements Requis",
      "eventsInGroup1": "Événements dans le Groupe 1",
      "eventsInGroup2": "Événements dans le Groupe 2",
      "roundedUp": "Arrondi au nombre entier le plus proche",
      "eventsNote": "Ce sont le nombre d'événements requis, pas le nombre de sujets"
    },
    "inputs": {
      "alpha": "α (Alpha)",
      "beta": "β (Bêta)",
      "p": "p (Proportion Attendue)",
      "d": "d (Marge d'Erreur)",
      "sd": "σ (Écart-Type)",
      "p1": "p₁ (Proportion Groupe 1)",
      "p2": "p₂ (Proportion Groupe 2)",
      "or": "OR (Rapport de Cotes Attendu)",
      "rr": "RR (Risque Relatif Attendu)",
      "epsilon": "ε (Précision Relative)",
      "r": "r (Coefficient de Corrélation Attendu)",
      "p0": "p₀ (Proportion Hypothèse Nulle)",
      "pa": "pₐ (Proportion Hypothèse Alternative)",
      "mu1": "μ₁ (Moyenne Groupe 1)",
      "mu2": "μ₂ (Moyenne Groupe 2)",
      "sd1": "σ₁ (Écart-Type Groupe 1)",
      "sd2": "σ₂ (Écart-Type Groupe 2)",
      "r1": "r₁ (Corrélation Groupe 1)",
      "r2": "r₂ (Corrélation Groupe 2)",
      "lambda1": "λ₁ (Taux Groupe 1)",
      "lambda2": "λ₂ (Taux Groupe 2)",
      "k": "k (Ratio d'Allocation)"
    },
    "tooltips": {
      "alpha": "Niveau de signification (ex: 0.05 pour 95% de confiance)",
      "beta": "Taux d'erreur de type II (ex: 0.2 pour 80% de puissance)",
      "p": "Proportion attendue de l'attribut dans la population (utilisez 0.5 si inconnue)",
      "d": "La précision souhaitée (ex: 0.03 pour ±3%)",
      "sd": "Écart-type estimé de la population",
      "p1": "Proportion attendue dans le premier groupe",
      "p2": "Proportion attendue dans le deuxième groupe",
      "or": "Le Rapport de Cotes anticipé",
      "rr": "Le Risque Relatif anticipé",
      "epsilon": "ex: 0.2 pour 20% de précision",
      "r": "Le coefficient de corrélation attendu (entre -1 et 1)",
      "p0": "La proportion sous l'hypothèse nulle",
      "pa": "La proportion sous l'hypothèse alternative",
      "mu1": "Moyenne attendue pour le groupe 1",
      "mu2": "Moyenne attendue pour le groupe 2",
      "sd1": "Écart-type pour le groupe 1",
      "sd2": "Écart-type pour le groupe 2",
      "r1": "Corrélation attendue dans le groupe 1",
      "r2": "Corrélation attendue dans le groupe 2",
      "lambda1": "Taux d'incidence dans le groupe 1 (événements par personne-année)",
      "lambda2": "Taux d'incidence dans le groupe 2",
      "k": "Ratio des sujets dans le groupe 2 au groupe 1 (ex: 1 pour des groupes égaux)"
    },
    "placeholders": {
      "alpha": "0.05",
      "beta": "0.2",
      "p": "0.5",
      "d": "0.05",
      "sd": "ex: 15",
      "p1": "0.5",
      "p2": "0.4",
      "or": "2",
      "rr": "2",
      "epsilon": "0.2",
      "r": "0.3",
      "p0": "0.5",
      "pa": "0.6",
      "mu1": "ex: 100",
      "mu2": "ex: 95",
      "sd1": "ex: 15",
      "sd2": "ex: 15",
      "r1": "0.5",
      "r2": "0.3",
      "lambda1": "ex: 0.05",
      "lambda2": "ex: 0.03",
      "k": "1"
    },
    "errors": {
      "invalidInputs": "Veuillez fournir des entrées valides.",
      "proportionRange": "La proportion doit être entre 0 et 1.",
      "positiveValues": "Les valeurs doivent être positives.",
      "differentValues": "Les valeurs doivent être différentes les unes des autres.",
      "correlationRange": "La corrélation doit être entre -1 et 1 (et pas 0).",
      "p1Exceeds1": "Le p1 calculé dépasse 1. Veuillez ajuster vos valeurs OR ou p2.",
      "rrP1Exceeds1": "Le p1 calculé dépasse 1. Veuillez ajuster vos valeurs RR ou p2."
    },
    "footer": "Fait par Mohamad AlJasem et Prof. Alipasha Meysamie - Université des Sciences Médicales de Téhéran",
    "pwa": {
      "installTitle": "Installer l'App",
      "installDescription": "Installez cette application sur votre appareil pour un accès rapide et une utilisation hors ligne.",
      "install": "Installer",
      "dismiss": "Pas Maintenant"
    },
    "export": {
      "title": "Exporter les Résultats",
      "pdf": "Rapport PDF",
      "csv": "Données CSV",
      "copy": "Copier le Texte",
      "save": "Sauvegarder le Calcul"
    },
    "calculatorData": {
      "estimateProportion": {
        "title": "Proportion Unique",
        "description": "Calcule la taille d'échantillon nécessaire pour estimer une proportion de population avec une marge d'erreur spécifiée.",
        "usage": "Utilisez ce test lorsque vous voulez estimer une proportion unique dans une population avec un niveau de précision spécifique (intervalle de confiance). C'est idéal pour les études de prévalence, les enquêtes ou le contrôle qualité où vous devez connaître \"quel pourcentage\" d'une population a une certaine caractéristique.",
        "example": "Estimer la prévalence du diabète dans une ville, déterminer le pourcentage d'étudiants qui réussissent un examen, ou trouver la proportion de produits défectueux dans la fabrication."
      },
      "estimateMean": {
        "title": "Moyenne Unique",
        "description": "Calcule la taille d'échantillon nécessaire pour estimer une moyenne de population avec une marge d'erreur spécifiée.",
        "usage": "Utilisez ce test lorsque vous voulez estimer la valeur moyenne d'une variable continue dans une population avec une précision spécifique. Vous devez connaître ou estimer l'écart-type de la variable.",
        "example": "Estimer la pression artérielle moyenne chez les adultes, déterminer le poids corporel moyen dans une population, ou calculer les scores moyens aux tests."
      },
      "estimateDiff2Proportions": {
        "title": "Différence Entre 2 Proportions",
        "description": "Calcule la taille d'échantillon par groupe pour estimer la différence entre deux proportions de population.",
        "usage": "Utilisez ce test lorsque vous voulez estimer la différence en proportions entre deux groupes indépendants avec une précision spécifiée. C'est utile pour comparer les taux de prévalence ou les pourcentages entre deux populations.",
        "example": "Comparer les taux de tabagisme entre hommes et femmes, estimer la différence dans les taux de guérison entre deux protocoles de traitement, ou comparer la prévalence de la maladie à travers deux régions."
      },
      "estimateOddsRatio": {
        "title": "Rapport de Cotes",
        "description": "Calcule la taille d'échantillon pour estimer un Rapport de Cotes avec une précision relative spécifiée.",
        "usage": "Utilisez ce test pour les études cas-témoins lorsque vous voulez estimer le rapport de cotes (force d'association entre exposition et résultat) avec un niveau de précision spécifique. Les rapports de cotes sont particulièrement utiles lorsque le résultat est rare.",
        "example": "Estimer l'association entre le tabagisme et le cancer du poumon dans une étude cas-témoins, étudier la relation entre un marqueur génétique et le risque de maladie."
      },
      "estimateRelativeRisk": {
        "title": "Risque Relatif",
        "description": "Calcule la taille d'échantillon pour estimer un Risque Relatif avec une précision relative spécifiée.",
        "usage": "Utilisez ce test pour les études de cohorte ou les essais cliniques lorsque vous voulez estimer le risque relatif (ratio de risque) avec une précision spécifique. Le risque relatif compare la probabilité d'un résultat entre les groupes exposés et non exposés.",
        "example": "Estimer le risque de maladie cardiaque chez les fumeurs vs non-fumeurs dans une étude de cohorte, comparer les taux d'infection entre les groupes vaccinés et non vaccinés."
      },
      "estimateCorrelation": {
        "title": "Coefficient de Corrélation",
        "description": "Calcule la taille d'échantillon nécessaire pour estimer un coefficient de corrélation.",
        "usage": "Utilisez ce test lorsque vous voulez estimer la force d'une relation linéaire entre deux variables continues avec un niveau de précision spécifique. C'est courant dans les études observationnelles examinant les associations.",
        "example": "Estimer la corrélation entre l'âge et la pression artérielle, étudier la relation entre les heures d'étude et les scores aux examens, ou examiner l'association entre la taille et le poids."
      },
      "testProportion": {
        "title": "Proportion Unique",
        "description": "Compare une proportion observée à une proportion de population hypothétique.",
        "usage": "Utilisez ce test lorsque vous voulez tester si une proportion de population diffère d'une valeur hypothétique spécifique. Vous devez spécifier à la fois la proportion d'hypothèse nulle et la proportion alternative que vous voulez détecter, avec la puissance souhaitée.",
        "example": "Tester si un nouveau médicament a un taux de succès différent du standard de 50%, déterminer si le soutien des électeurs dépasse 60%, ou vérifier si les taux de défaut sont en dessous de 5%."
      },
      "test2Proportions": {
        "title": "Deux Proportions",
        "description": "Compare les proportions entre deux groupes indépendants.",
        "usage": "Utilisez ce test lorsque vous voulez comparer les proportions entre deux groupes indépendants et tester s'il y a une différence statistiquement significative. C'est l'un des tests les plus courants dans les essais cliniques et les études épidémiologiques.",
        "example": "Comparer les taux de guérison entre les groupes de traitement et de contrôle, tester si les taux de tabagisme diffèrent entre les sexes, ou comparer les taux d'infection entre deux vaccins."
      },
      "test2Means": {
        "title": "Deux Moyennes",
        "description": "Compare les moyennes de deux groupes indépendants.",
        "usage": "Utilisez ce test lors de la comparaison des valeurs moyennes d'une variable continue entre deux groupes indépendants. C'est la base de nombreux essais cliniques et études expérimentales où vous mesurez des résultats continus.",
        "example": "Comparer la réduction moyenne de la pression artérielle entre deux médicaments, tester si la perte de poids moyenne diffère entre les programmes de régime, ou comparer les scores moyens aux tests entre les méthodes d'enseignement."
      },
      "test2Correlations": {
        "title": "Deux Coefficients de Corrélation",
        "description": "Compare les coefficients de corrélation entre deux groupes indépendants.",
        "usage": "Utilisez ce test lorsque vous voulez comparer la force des relations linéaires entre deux variables continues à travers deux groupes différents. Cela aide à déterminer si les associations diffèrent entre les populations.",
        "example": "Tester si la corrélation entre l'exercice et la pression artérielle diffère entre les adultes jeunes et âgés, comparer la relation entre le temps d'étude et la performance à travers différentes écoles."
      },
      "test2Rates": {
        "title": "Deux Taux d'Incidence",
        "description": "Compare les taux d'incidence entre deux groupes (ex: dans une étude de cohorte). Calcule les événements requis par groupe.",
        "usage": "Utilisez ce test pour les études de cohorte ou les essais cliniques où vous comparez le taux auquel les événements se produisent dans le temps entre deux groupes. Cela tient compte des temps de suivi variables et est idéal pour les données de temps jusqu'à l'événement.",
        "example": "Comparer les taux d'hospitalisation entre les groupes traités et non traités, tester si les taux d'infection par personne-année diffèrent entre les cohortes vaccinées et non vaccinées, ou comparer les taux de mortalité dans les études longitudinales."
      }
    }
  },
  "tabs": {
    "advanced": "Avancé",
    "about": "À propos",
    "calculators": "Calculateurs",
    "education": "Éducation",
    "settings": "Paramètres"
  },
  "features": {
    "visualization": {
      "title": "Visualisation de données",
      "description": "Graphiques et diagrammes interactifs"
    },
    "power": {
      "title": "Analyse de puissance",
      "description": "Outils d'analyse de puissance avancés"
    },
    "bayesian": {
      "title": "Analyse bayésienne",
      "description": "Méthodes bayésiennes avec distributions a priori"
    },
    "sequential": {
      "title": "Analyse séquentielle",
      "description": "Conceptions d'études adaptatives et séquentielles"
    },
    "history": {
      "title": "Historique des calculs",
      "description": "Enregistrer et gérer les calculs précédents"
    }
  },
  "settings": {
    "language": "Langue",
    "theme": "Thème",
    "profile": "Profil",
    "darkMode": "Mode sombre",
    "lightMode": "Mode clair"
  }
}
